Revit 2027 API
SizingOptions.Diameter Property
 The diameter of round duct or pipe in feet.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Diameter { get; }
Public ReadOnly Property Diameter As Double
	Get
public:
property double Diameter {
	double get ();
}
member Diameter : float with get
Property Value
Double
See Also
Reference
SizingOptions Class
Autodesk.Revit.DB.Analysis Namespace